{
  "_id": "1000016089",
  "fetchSuccess": true,
  "title": "Rahdo Talks Through",
  "authors": [
    "podcast@rahdo.com"
  ],
  "itunesId": "1000016089",
  "feedUrl": "http://feeds.feedburner.com/RahdoTalksThrough",
  "description": "A monthly podcast all about boardgames, hosted by Richard \"Rahdo\" Ham",
  "category": "Games & Hobbies",
  "episodes": [
    {
      "title": "RTT Episode #23",
      "description": "Top 10x4 SHOW NOTES: •••[00:01:05] Games of Interest►►► Codenames Duet, Flip Ships, Helionox Deluxe Edition, Hardback, Klondike Rush, Kitchen Rush, Pursuit of Happiness: Community, Palace of Mad King Ludwig, Sentient, Catacombs: Wyverns of Wylemuir, Brass: Birmingham •••[00:27:05] Top10 Revists►►► Felds, Rule Breakers, Deluxe Reprint Needed, Tardis Games •••[00:50:11] Boardgame Q&A►►► Game design vocabulary? Best themes for euro mechanics? Rahdo awards? Take that against AI? How do I classify my BGG collection? Innovation in boardgames vs videogames? Components vs gameplay? How to remember rules? Needed rule tweaks? Fave Dominion stuff? Fave Agricola stuff? •••[01:33:05] Non-Boardgame Q&A►►► Non boardgame mastery? Maltese dishes? First jobs? College majors? Languages spoken? How's RRT doing? Frugal living? What does an American expat miss? Chocolate stroopwafel? Fave animals? Jen's fave glass piece? •••Direct MP3 link: https://archive.org/download/rtt_023/rtt_023.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #22",
      "description": "Jen's back!!! SHOW NOTES: Escape room nightmare: https://youtu.be/YQSe19aX9Vw?t=43m10s •••[00:01:35] Games of Interest►►► Empyreal: Spells & Steam, Caverna: Höhle gegen Höhle, Codenames: Disney & Marvel Editions, Mottainai: Wutai Mountain, UBOOT: The Board Game, The Expanse, TIME Stories: Estrella Drive & Brothers of the Coast, Aeon's End: War Eternal, Otys, Custom Heroes, Raid on Taihoku •••[00:22:15] Boardgame Q&A►►► Top 5 verbs? Co-op settings? Dream IP? Further Legacy clarification? How to figure out if a game will be good? Honeymoon games? Too many reprints? Multiple characters per player? Auto-succeed die rolls? Perfect co-op dungeon crawl? Which boardgame reviewer do I want to play with? Fresh ideas? What to reprint? Most simpatico boardgame reviewer? Non-BGG online boardgame resources? Best year for boardgames? RTT guests? When will top10 get an update? How can I cover Gloomhaven? To sleeve or not to sleeve? Impulse purchases? First Pandemic play for non-gaming spouse? Rococco jewelry box? Ideal future TIME Story settings? Best & worst components? How to get family more excited about gaming? Game coverage timing? Do I ever finish the runthrough? Percentage of successful kickstarters? My impact on kickstarters? Preferred backup colours? First Feld?  Gamechanging mechanisms? Jen's feelings about Jack the Ripper? Seeland modules? Roll & writes? Dice Tower Con? Dream boardgame? Sirlin games? How did I get Dogs: the boardgame? Off market games? Pfister's standing? Limited moves a design strength or flaw? Gloomhaven alternative? More co-ops... what does it mean? Societal standing of games? Mechanisms first or theme first? Dominion over Trains? •••[01:43:20] Non-Boardgame Q&A►►► 2016 & 2017, really the worst? Escape room experiences? France trip? How do I deal with the negativity thrown at RRT? C'mon, 2016 wasn't that bad, really? How is the real me different than Rahdo? Me as John Wick? My 3 worst habits, according to Jen? When will we leave Malta? A day in the life of me and Jen? Different sleep patterns impact on marriage? Grocery shopping? Programming languages? Westworld? Malta mules? Unpacking? Funniest movie? Medical situation in Malta? Beer situation in Malta? Storm situation in Malta? College tips? Auditory processing disorder? What about Scuttle? •••Direct MP3 link: https://ia801505.us.archive.org/23/items/RTT022/RTT022.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #21",
      "description": "Flying solo this month, which is why it's so late! SHOW NOTES: •••[00:00:50] Games of Interest►►► Pandemic Legacy Season 2, Notre Dame 10th Anniversary, In the Year of the Dragon 10th Anniversary, The City of Kings, Aeon's End: Eternal War, Clank! Sunken Treasures, Card City 2, Die Gärten von Versailles, Detective: City of Angels, Valletta, Bear Park, El Dorado, Mystic Vale: Das Tal der Magie & der Wildnis, Pit Crew, Port Royal: The Adventure Begins, Professor Evil and the Citadel of Time, Quadropolis: Public Services, Seventh Cross, Santo Domingo, Thrash n Roll: Amplified, Steam Ship Company, CO2 2nd edition, Brasil, Loot Island •••[00:51:05] BGG Top 100-50 Countdown •••[01:38:05] Top 10 Revisit: My first games •••Direct MP3 link: https://archive.org/download/rtt021/rtt021.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #20",
      "description": "2017 is upon us!!! SHOW NOTES: 2017 Games of Interest Geeklist: https://boardgamegeek.com/geeklist/218452/rahdo-runs-through-2017-games-interest Top 25 Most Anticipated Games: https://www.youtube.com/watch?v=kj5PHRTQJrI TIME Stories \"Rahdo 2p\" variant: https://www.boardgamegeek.com/article/22413568#22413568 •••[00:01:54] 2017 Games of Interest►►► On Mars, Alter Ego, First martians, Edge of Humanity, Fugitive, Zombies Run!, Dragonsgate College, Brasil, Brass, Trashing Dice, Arcology, Chimera Station, Clockwork Islands, Sagrada, Spirit Island, Apocrypha Adventure Card Game, Legacy: Time Surge, Kingsburg 2nd Edition, harvest, The Captain is Dead, Jump Drive, 5 Minute Dungeon, Perfect Storm, Fog of Love, Skyways, Island of Doctor Necreaux: Second Edition, Tiny Epic Quest, COG, Element & Idols, Exodus Fleet, Reborn From Flame, Yamatai, Mines of Olnak, Thunderstone Quest, Railways of Nippon, Catacombs & Castles, 100 Swords Expansions, Shadowrift Skittering Darkness, Haspelknecht: Ruhr Valley, Kingdom Builder Harvest, Temporum Alternate Realities, Tiny Epic Galaxies: Beyond the Black, Mysterium 2nd Expansion, Automobiles Racing Season, Nations the Dice Game: Unrest, Hero Realms: Ruins of Thandar, Roll Player: Monsters & Minions, TIME Stories Expedition Endurance & Lumen Fidei •••[01:25:50] 2016 Games of Interest Revisit►►► Acute Care, Shadowrift: Eve of the Sickle Moon, Feudum, Dungeon Scroll, Perfect Storm, Brasil, Islebound, 7th Continent, TIME Stories Prophecy of Dragons, Eminent Domain: Exotica, Manhattan Project Energy Empire, Explorers of the North Sea, Dreamwell, The Networks, Fog of Love, Rising 5, Solarius Mission, Roll Player, Guilds of London, Quadropolis, Lisboa, Legend of Andor: Chada & Thorn, Legends of Andor: Journey to the North, Star Trek Frontiers, Gloomhaven •••[01:49:28] Boardgame Q&A►►► Knizia's LotR experiences? BGG top 200? Kingdom Death Monster? TIME Stories variant? My boardgaming history? Conventions? Legacy mechanism? Feld love? Taluva? •••[02:17:45] Non-Boardgame Q&A►►► Holiday plans? New Years resolutions? Maltese radio & TV? RRT malta? Games for celebs? •••Direct MP3 link: https://archive.org/download/rtt020/rtt020.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #19",
      "description": "Count downs... SHOW NOTES: •••[00:01:56] Top 10 Revisits►►► Disagreements, Regrets, and Pre-2009 •••[00:47:06] BGG Top 50 eval •••[01:30:10] Boardgame Q&A►►► Artistic impact? Crunchy co-ops? Dice supercut? •••[01:46:28] Non-Boardgame Q&A►►► Malta castle? Free time? Olive oil? Mongol history? Culture shock? •••Direct MP3 link: https://archive.org/download/rtt019/rtt019.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #18",
      "description": "A return to normalcy! SHOW NOTES: (HUGE thanks to Nick Lamb for helping clean up Jen's audio on this one!) Miwi Copycat video: https://www.youtube.com/watch?v=tJU3iakFNj8 Aye Dark Overlord event at Gencon: https://www.youtube.com/watch?v=3DWEm54yxcU Essen Preview Geeklist tool: http://tabletoptogether.com/essen-spiel/index.php •••[00:01:33] New Games of Interest►►► Jump Drive, Temporum: Alternate Realities, A Dog's Life, Skyways, The Stygian Society, Zombies, Run! The Boardgame, Shadowrift: Skittering Darkness, Dominion Update Pack, Anduine: First City in the West, Tribes •••[00:16:49] Top 10 Revisits►►► Tile Laying Games, Pirate Games, Games I Wish I Could Play More •••[00:33:45] Boardgame Q&A►►► What alteration to a game from my feedback and I most proud of? What traits can we identify in each other that pegs us as boardgame lovers? Rahdo Runs Through Scythe? Any Rahdo impersonators? Any RRT helpers besides Paulo (and Thomas Giles)? A runthrough of Rahdo Runs Through? Anything in Essen we recommend checking out? Cash at Essen Spiel? How to digest the Essen Spiel preview geeklist? Emotional Runthroughs? Changing direction of the industry? Controversial theme? Post game rituals? Game component fever? Agricola Revised or Classic? Monopoly runthrough? Why is Terraforming Mars too mean? RTT filesize? Funky interlude music? Top 50 BGG runthrough? Mechs vs Minions feedback? Rahdo domain name? Life post Rahdo Runs Through?  •••[01:33:07] Non-Boardgame Q&A►►► My brother's misadventures? Days Gone from Eidetic? Time for a Syphon Filter comeback? Which game I've worked on would I revisit? Tricks to early retirement? Theater background? Have boardgame companies tried to hire me? Competitive videogame scene? Adjusting to life in the UK? Most memorable 30 minutes of our lives? •••Direct MP3 link: https://archive.org/download/RTT018/RTT018.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #17",
      "description": "SPIEL 2016 PREVIEW!!! SHOW NOTES: Eric Martin's Spiel Preview Geeklist: https://boardgamegeek.com/geeklist/193588/spiel-2016-preview Louise McCully's Spiel Promo Geeklist: https://boardgamegeek.com/geeklist/212177/essen-spiel-2016-specials-freebies-promos-and-othe Enter Jen's Spiel 2016 giveaway at: http://www.jenefer.net •••[00:04:21] Most Anticipated Games #45-11►►► Power Grid: The Card Game, Motion Pictures: movies out of cardboard, Die Baumeister des Colosseum, Chariot Race, forestaurant, Kepler 3042, Terraforming Mars, Martians A Story of Civilization, Honshu, Kingsburg 2nd Edition, Dream Home, Habitats, Morpheus, Fabled Fruit, The Daedalus Sentence, Codenames: Pictures, Treasure Lair, Risky Adventure, Taluva Deluxe, Meduris, London Dread, Legendary Inventors, Robinson Crusoe, Capital, Barcelona: The Rose of Fire, Rhein: River Trade, Nautilion, A Feast for Odin, (Cottage Garden), Lorenzo il Magnifico, Ulm, Touria, Doodle China, Pandemic Iberia, First Class: Unterwegs im Orient Express, Solarius Mission •••[01:14:18] Jen's Essen Plans and Top 10 Most Anticipated Gamess►►► The Colonists, The Golden Sails, 4 Gods, Gluck Auf: Das grosse Kartenspiel, Order of the Guilded Compass, Railroad Revolution, Great Western Trail, La Granja: The Dice Game no siesta, Key to the City - London, The Oracle of Delphi •••[01:32:00] Most Anticipated Expansions►►► Abenteuerland: Konig und Prinzessin, Aeon's End: The Depths, Alchemists: King's Golem, Ancient Terrible Things: The Lost Chapter, Clinic: Medical Dossier 3, Istanbul: Brief & Siegel, Mysterium: Hidden Signs, Mystic Vale: Vale of Magic, Networks: On the Air, Oh My Goods: Longsdale in Aufruhr, Orleans: Handel & Intrige, Pandemic: the Cure - Experimental Meds, Peloponnes Card Game: Patronus, Port Royal Unterwegs!, Russian Railroads: American Railroads, Simurgh: Call of the Dragonlord, Small City: Big Tiles, Taschkent Erweiterung •••[01:53:24] Spiel debuts already covered by Rahdo Runs Through►►► Aeon's End, Alchemidus, Anachrony, At the Gates of Loyang, Ave Roma, Clank!, Colony, Commissioner Victor, Crisis, Dale of Merchants 2, Days of Ire, Dungeon of Fortune, Fantahzee: Hordes & Heroes, Fields of Green, Guilds of London, Heir to the Pharaoh, In the Name of Odin, Jorvik, Kingdomino, Kodama: The Tree Spirits, Mask of Anubis, Morocco, Mystic Vale, Mythe, Oceanos, Perdition's Mouth, Perfumer, Rattle Battle Grab the Loot Angry Ocean, Roll for the Galaxy: Ambition, Round House, Schotten Totten, Squirrel Rush, The Networks, Tramways, (Vinhos Deluxe Ediiton), Virus, Yokohama  •••[02:31:05] Demo-only Spiel Games►►► Guilds, Sword & Sorcery, Dungeon Heroes Manager, Iunu, Mines of Olnak, Perfect Crime, Save the President, Save the World, Museum, Nemesis, Kung Fu Panda the Board Game, Tiny Epic Galaxies Beyond The Black, Tiny Epic Quest, Glory: A Game of Knights, Rising 5, Edge of Humanity, Gloomhaven •••[02:50:47] Most Anticipated Promos►►► Anachrony 10 card promo pack, Ave Roma packs, Brettspiel Adventskalender 2016, Codenames Pictures promo tiles, Colony promo pack, Dale of Merchants Systemaic Eurasian Beavers, Deutscher Spielepreise 2016 Goodie Box, Dominion Sauna, Fields of Green: Crop Circle, Goons of New York, Guilds of London Essen Guilds promo, Inhabit the Earth tile rack, Keyflower: Keymelequin, Kodama playable goodies, Lorenzo il Magnifico Leader cards, Mysterium Meeple, Quadropolis Ludo Fact, Rattle Battle Grab the Loot metal coins and Port Scuffle, Rrobinson Crusoe Poachers scenario, Round House promo cards and tiles, Russian Railroads American Railroads, Singe Card Game, Snowdonia Season promo cards, Terraforming Mars launch kit promo, Vinhos Deluxe Edition packs  •••Direct MP3 link: https://archive.org/download/RTT017ii/RTT017ii.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #16",
      "description": "Q&A-PALOOZA!!!! SHOW NOTES: •••[00:02:22] Game/RTT Questions►►► Rahdo-designed boardgame? More advent calendar/Malta travelogue vids? Kickstarter preferential treatment? Conflict vs game harshness? Voters override me? Revising older games? Top 5 games that need more thumbs? KS stretch goals on the up and up? Oldie game-day? Will we be Essen 2016? •••[00:31:24] Non-Game/RTT Questions►►► What's it like being a videogame designer? Jen's aversion to guns in games? Fave ice cream? \"If money was no object...?\" Fave weather? Jen's key to business success? Best book/fave author? Ever heading to China? Survivor fan chat? Jen's childhood? Top places visited? Top places yet to be visited? Excited about visiting Portugal? Most impactful recent book? Jen's fave color of glass to work? Who's best at (various things) - me or Jen? Brexit & RRT? Why did I retire from making games? Thoughts on No Man's Sky? Best places to eat in downtown Seattle? Pokemon GO? Are games a worthwhile endeavor? How's the pup search going? Ever fostered dogs? •••[01:57:44] Repeat Questions from Podcast 14►►► Rulebook rules? Total RRT playtime? Eurotrash? Ever change my mind? What themes are over/under represented? Sexy mini's? In-jokes in boardgames? LeiriaCon 2017? Do oldies hold up? The Rahdo Effect? Production values of RRT vs WIP? Best and worst things about doing RRT? Best historical time period? Best example of some game genres? Ranking obsession? Ranking validity? Game obsession post RRT? Games Jen likes more than me? Boardgame journalism ethics? Top 10 topics? •••Direct MP3 link: https://archive.org/download/RTT016Fix/RTT016-fix.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #15",
      "description": "GENCON!!!! SHOW NOTES: W Eric Martin's excellent preview geeklist: https://www.boardgamegeek.com/geeklist/198728/gen-con-2016-preview •••[00:04:18] What to buy?►►► Goons of New York 1901, Lotus, Medici, Grimslingers, America, Welcome Back to the Dungeon, IKI, Karuba, RA, Telsa V Edison: Powering Up, Burano, Guilds of London, Great Dinosaur Rush, Saloon Tycoon, Valley of the Kings: Last Rights, Dreamwell, Arcane Academy, Bill & Ted's Excellent Boardgame, Agility, In the Name of Odin, Mysterium Hidden Signs, The King's Abbey, Sunrise City: Nights, Terraforming Mars, Codenames: Pictures, Simurgh, Oceanos, Fantahzee: Hordes & Heroes, Shakespeare: Backstage, Epic Resort: Villain's Vacation, Millennium Blades: Promo Pack #2, Legends of Andor: Call of the Skralls, Clank!, Beyond Baker Street, Mansions of Madness: Second Edition, Via Nebula, Kraftwagen V6, Pursuit of Happiness, Dominion Empires, London Dread, Islebound, Rattle Battle Grab the Loot: Angry Ocean, Vast: The Crystal Caverns, Covert, The Goonies Adventure Card Game, Harry Potter Hogwarts Battle, Project: Elite & Adrenaline, Order of the Gilded Compass, Castles of Burgundy The Card Game, The Networks, Mystic Vale, Pandemic: Reign of Cthulhu •••[01:53:31] What to demo?►►► Mint Works, Loony Quest, Conan, Defense Grid: The Board Game, Born to Serve, One Deck Dungeon, Showtime!, The Ninth World, StarFall, Museum, 1001 Odysseys, Haspelknecht, Dream Home, The Kings Abbey: Lethal Steel, Motion Pictures, Coldwater Crown, Legendary Inventors, Medici: The Card Game, Lunarchitects, Crisis, Fugitive, Shadowrift, Spirit Island, 4 Gods, Tiny Epic Galaxies: Beyond the Black, Tiny Epic Quest, Sagrada, Alchemists: Golem Expansion, Legends of Andor: Journey to the North, Attack on Titan: Deck Building Game, Apocrypha Adventure Card Game, Manhattan Project: Energy Empire, Rising 5: Runes of Asteros, Colony, Black Orchestra, The Walking Dead: No Sanctuary, The Stygian Society, Gloomhaven •••Direct MP3 link: https://archive.org/download/RTT015/RTT015.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #14",
      "description": "SOOOO many questions! SHOW NOTES: •••[00:00:25] Games of Interest►►► Hero Realms, Targi Expansion, Angry Ocean, Walking Dead: No Sanctuary, Fabled Fruit, The Bird Told Me To Do It, Mines of Olnak, Legends of Andor: Dark Heroes, Lorenzo the Magnificent •••[00:27:45] Top 10 2p Only Games Revisited •••[00:36:54] Q&A►►► How many games a week? LOAD controversy? Hybrid games? Rethinking dismissed games? What themes would Jen like to see? Scantily clad minis? How to keep collection under control? Most played games? \"In the know\" games? Overproduced games? LeiriaCon? Do old faves still stand up? The Rahdo effect? Watch it played? What would RRT videosgames look like? What kind of conflict do we avoid? Jen's mic? Standard boardgame review format? Most viewed vids? Best and worst things about RRT? Fave historical period for games? Best games to represent various mechanisms? Why so much ranking? How can I rank with so few plays? Can I leave the cult of the new? Update on Jen's top10? How to get into boardgame graphic design? Why no good boardgames in mainstream stores? What's gaming like in Germany? What were our \"next step\" games? How to help AP? Gateway to Agricola? Treasure hunting games? Does Jen disagree about games with Rahdo? Are game reviewers too tight with game publishers? Conflict heavy top 10? Table Top audience? •••Direct MP3 link: https://archive.org/download/RTT014/RTT014.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough •••Send your questions to questions@rahdo.com"
    },
    {
      "title": "RTT Episode #13",
      "description": "2 weeks late, but hopefully worth the wait! Send your questions to questions@rahdo.com SHOW NOTES: •••[00:00:38] Games of Interest►►► Pandemic: Iberia, Sagrada, Shakespeare: Backstage, Tavern's Tales, Shadowscape, Pioneer Days, Myth: Dark Frontier, Tiny Epic Galaxies: Beyond the Black, Perfect Crime, Order of the Guilded Compass, Fields of Green, Descent: Road to Legend, Rocky Road a la Mode, The Pirate Republic, Deus: Egypt, Tiny Epic Quest, Clank! •••[00:30:25] Top 10 Mechanisms Revisited •••[00:40:15] Q&A►►► Hybridized RPGs? Original goals of RRT? Dice Tower Awards? LotR games? Kickstarter impact on FLGS's? Design my own game? Kingdom Builder expansions? Orleans Expansion setup? What makes a great rulebook? What would end RRT? Game age ratings? Pet related game disasters? Games for cats & dogs? Game calibration? Impact of game promos? •••[02:01:56] Q&A Personal Side►►► Living on a boat? Cat lover? Rightie or Leftie? Roller coasters? Top 20 TV Shows? Brexit? •••Direct MP3 link: https://archive.org/download/RTT013/RTT013.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #12",
      "description": "Final episode of the first year o' podcasting! Send your questions to questions@rahdo.com SHOW NOTES: •••[00:00:27] Games of Interest►►► La Granja: No Siesta, Virus, Legends of Andor: the Last Hope, Codename: Pictures, Charterstone •••[00:14:28] Top 10 Revisits►►► Exploration & Solo games •••[00:35:49] Dice Tower & GAMA Trip Report •••[01:40:12] Q&A►►► Fairness of big vs small publishers on Kickstarter? How do I learn rules & relearn so fast? Suburbia expansions? Jen's glass? Rahdo origin? Scientific skepticism? Star Trek Frontiers? 2p auction games? Boardgames for a videogame design class? Videogame design class assignments? TIME Stories? Laserdiscs? All things being equal, a boardgame or videogame design career? How can I make so many violent videogames yet be such a cardboard carebear? Game teaching? How to play against an experienced opponent? Can love of theme win out over player conflict? Potty mouth? Jen the shark? •••[02:51:25] Q&A Personal Side►►► Scientific skepticism part II? Hillary or Bernie? Fave songs? •••Direct MP3 link: https://archive.org/download/rtt012/rtt012.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #11",
      "description": "A very emotional podcast SHOW NOTES: 2016 Rahdo Runs Through Kickstarter campaign: http://2016.rahdo.com •••[00:02:42] Q&A►►► Lionhead closure? Seating position? Enough playthroughs to review? Certainty of atheist view? •••[00:27:25] Taloula :( •••[00:33:30] Q&A Continued►►► Gaming with The Dice Tower? Dominion for carebears? Among the Stars expansions? My videogame job description? Where do I shoot? Opinion swap during runthroughs? How does Paulo work? How was Bend? •••[01:18:03] Kickstarter update & More Taloula :( •••[01:25:57] New Games of Interest►►► Colony, Via Nebula, Attack on Titan: Deck Building Game, The Last Ruin, Tentacles of Time, Trashing Dice, Kingdom Builder Harvest, High Treason: The Trial of Louis Riel, Valley of the Kings: Last Rites •••[01:38:12] Top10 Recaps►►► Pickup & Deliver, Economic •••[01:53:48] Kickstarter Contest!! •••Direct MP3 link: https://archive.org/download/RTT011/RTT-011.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #10",
      "description": "SHOW NOTES: •••[00:01:03]New Games of Interest►►► Airlines, Dice Stars, Oceanos, The Great Chariot Race,The Golden Sails, Bohemian Villages, COGS, Star Trek Panic, Great Western Trail, Terraforming Mars, Epic Resort Villain's Vacation, Catacombs and Castles, The Grizzled: At Your Orders, TIME Stories: Expedition Endurance, Mask of ANUBIS, Mystic Vale  •••[00:18:20] Q&A►►► !!!Submit questions to questions@rahdo.com!!! Jen's response to Freedom: Underground Railroad? Rahdo reckless record? Livestreaming everything? What comes after Malta? Dominion attack cards? Expanding light filler games? Asmodee retail channel changes? Fave music? Point salad vs sandbox? Game burnout? Grandma's Boy authenticity? Thoughts on game variants? Plans for the next RRT kickstarter? New Agricola? A new Spiel des Jahres category? •••[02:00:30] Top10 Kickstarter Games Recap •••Direct MP3 link: https://archive.org/download/RTT010/RTT010.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #9",
      "description": "Six Top 10s + Pandemic: Legacy - game or expansion? SHOW NOTES: 2016 Games of Interest Geeklist: https://boardgamegeek.com/geeklist/201740/rahdo-runs-through-2016-games-interest Boardgame Pricing Utility: http://www.spielboy.com/GeekPrices.php Pandemic Legacy: the expansion thread (warning: spoilers) https://www.boardgamegeek.com/thread/1518368/legacy-4th-pandemic-expansion-spoilers-course London Walking Map http://content.tfl.gov.uk/walking-tube-map.pdf •••[00:00:42]New Games of Interest►►► Aeon's End, Retreat to Darkmoor, Fight for Olympus, Oracle of Delphi, Castles of Burgundy the Card Game, Grim Heroes, Brettspiel Easter Basket, Dale of Merchants 2, Bear Valley, Survival: Frogs of SE Australia, Agility, Knit Wit, Touria, Medici, Spirit Island, First Martians: Adventures on the Red Planet, Pandemic Reign of Cthulhu, Dominion: Empires, Coal Barons The Big Card Game, Istanbul: Brief & Siegel, Heir to the Pharaoh •••[00:37:28] Q&A►►► The Nintendo Story?, Dixit a themeatic game? How successful was my videogame career? Ever going back to work? Jen jealous of virtual Jen? Would we miss Malta? Love for Gold West? Out of print games? How important is having local gamers to play with? Fave anime? Boardgame bubble? Boardgame conventions worth it? Different types of attackey games? Advice for teaching games? Where do we vote? How to use Boardgamegeek.com? Best of London? Revisiting older games? Fave podcasts? Boardgames too expensive? Best EU online boardgame retailer?  •••[02:13:00] Top10 Recaps►►► Civilizations, Surprises, Best of 2016, Anticipated of 2016, Videogames, Expansions •••[02:50:49] Pandemic Legacy: The Expansion •••Direct MP3 link: https://archive.org/download/RTT009/RTT009.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough Posted by Richard Ham at 02:38 "
    },
    {
      "title": "RTT Episode #8",
      "description": "2016 Preview + Mega Q&A!!! SHOW NOTES: 2016 Games of Interest Geeklist: https://boardgamegeek.com/geeklist/201740/rahdo-runs-through-2016-games-interest 2016 Top 25 Most Anticipated Games: https://www.youtube.com/watch?v=BACAdkMhNzI •••[00:03:16] 49 Additional Games of Interest for 2016►►► Dragon Keepers, The Last Bastion, Quest for the Open Tavern, Sails to Steam, Simurgh: Call of the Dragonlord, The Expansive Hospital, Cabriole, ZNA, Valeria: Card Kingdoms, Villages of Valeria, Quests of Valeria, Arkwright, Millennium Blades, The Manhattan Project: Chain Reaction, Kingdom Builder: Marshlands, Covert, Welcome to Centerville, London Dread, Ein Fest für Odin, Cuisine a la Card, Unpublished Prototype, Vinhos Deluxe Edition, The Banner Saga: Warbands, Lunarchitects, Tiny Epic Western, Dingo's Dreams, Back to the Future: An Adventure Through Time, Clockwork Islands, Hitler Must Die, Tramways, Victorian Masterminds, In The Name of Odin, Dragonsgate College, Big Easy Business, Rokoko: Jewelry Box, The Exodus Fleet, Legacy: Time Surge, Saving Time, HOPE, Four Gods, Admiral of the Black, Elder Sign: Omens of Ice, Five Minute Delivery, 100 Swords: The Darkness Dungeon Builder Set, The Island of Doctor Necreaux: Second Edition, Beyond Baker Street, Fire of Eidolon, The North Sea Runesaga, This War of Mine: The Board Game •••[01:21:09] Q&A►►► Game industry labor ethics? Boundaries for Legacy mechanisms? Digital boardgames? TV shows & Movies that should be games? How's Shadowrun: Crossfire going? MTG helped us buy a house? What was my job at Nintendo? Surprising games? Equipment? What games should get the Legacy treatment? Gaming with designers? TMI? Mold? Table cloth? Caverna variants? What games do we wish we could play more? Favourite TV shows? Co-op videogames? Hard to get expansions? Game production troubles? The last designer? My crazy ratings? Games for the holidays? Seattle the best? Best Agricola expansion? Game buying in Malta? Other boardgame personalities? What makes a gamer a gamer? House rules? Smartphones at the table? Am I going to design a game? Soul crushing travel? Rahdo Runs Through, the convention? A day in the life? What's too sandboxey? Working on the worst videogame of all time? What happened to Spirits of the Rice Paddy? JJ Trek, really? Did the Force Awaken? •••Direct MP3 link: https://archive.org/download/rtt008/rtt008.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #7",
      "description": "Post BGG.con Show! SHOW NOTES: My BGG.con Runthrough Video: https://www.youtube.com/watch?v=iksdjeA6_fA •••[00:01:37] Travel Stories, part I►►► Dallas via Moscow •••[00:12:13] Games!►►► Roller Derby Final Jams (https://www.facebook.com/groups/219406578216672/) and the five Action Phase Prototypes •••[00:18:24] Pandemic Legacy stuff►►► (my variant thread: https://www.boardgamegeek.com/thread/1467497/13th-month-spoilers), •••[00:25:31] Pandemic Secret Project •••[00:28:08] Seafall •••[00:36:06] Chronicles: Origins •••[00:50:00] Travel Stories, part II►►► First spot of trouble •••[00:51:00] More Games ►►► HIDE, Skyliners, Fuse, 9th World: Numenera, Quadropolis, The Opulent, (Movie Making game - can't remember name) •••[01:14:36] The lovely people of BGG.con •••[01:25:05] Travel Stories, part III►►► Getting to Mom's •••[01:29:47] Online Guest Appearances►►► https://www.youtube.com/watch?v=YQSe19aX9Vw https://www.youtube.com/watch?v=3bJigI7OoCY https://www.youtube.com/watch?v=cE7pdT5_T_4 •••[01:31:10] Even more games!►►► Noblemen, Pagoda, Abyss •••[01:40:51] Travel Stories, Part IV►►► Leaving Mom's •••[01:45:20] Final games►►► Between Two Cities, Flick 'Em Up, Codenames •••[01:55:11] Travel Stories, Part V►►► Getting to New York, Saturday Night Live - live!, 36+ of travel hell •••Direct MP3 link: https://archive.org/download/rtt007/rtt007.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #6",
      "description": "The Post Essen show! SHOW NOTES: •••What Have We Been Playing? (00:00:58)►►► Broom Service, Fog of Love, Steam Ship Company, Nations the Dice Game expansion, Guilds of London, Fest Fur Odin, Hengist, Mysterium, [microfilms], Pandemic Legacy, 504 •••Q&A (00:31:55)►►► Multiplayer solitaire? How do i channel my inner-Jen? Gender specific boardgames? Boardgame storage: vertical or horizontal? So, no kids for Rahdo & Jen? What's the secret to a happy marriage? (please send your questions to questions@rahdo.com but ask for game recommendations at http://guild.rahdo.com) •••Essen Observations (01:13:12)►►► Run Rahdo, run! Packing tips! Fist bumps! Jen's booth! Travel misadventures! •••Top 10 Recap (01:29:00)►►► Games that need an expansion •••Wrapping it up (01:37:16)►►► BGG.con is coming! Boardgame advent calendar! •••Direct MP3 link: https://ia601500.us.archive.org/4/items/RTT006/RTT006.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #5",
      "description": "ESSEN SPIEL 2015!!! SHOW NOTES: [Jen's website to enter Essen Spiel contest:  http://www.jenefer.net] •••Owned and/or Already Ranthrough! (00:04:12)►►► dominion adventures [rio grande games/brave new world], poseidon's kingdom [game salute], among the stars revival [artipia], ancient terrible things [feuerland spiele], and then we held hands [ludicreations], pocket imperium [ludicreations], aramini circus [iello], assualt on doomrock: doompocalypse [beautiful disaster games], automania [aporta games], burano [emperorS4 [tbd group], castles of mad king ludwig: secrets [bezier], favor of the pharaoh [bezier], catacombs [elzra [schwerkraft-verlag], tiny epic galaxies [gamelyn games [schwerkraft-verlag], the golden ages [stronghold/Schwerkraft-Verlag], space cadets: away missions [stronghold], city council deluxe edition [golden egg games], la granja [stronghold], prime time [golden egg games], rome: rise to power [golden egg games], project elite [artipia games], tesla v edison [artana], fleet commander *I WAS TALKING ABOUT HULL BREACH HERE* [capsicum games], exoplanets [board&dice/polish publishing league], cthulhu realms [ADC Blackfire], flip city [ADC blackfire], dungeon of fortune [ADC blackfire], harbour [frosted games], dice city [AEG], discoveries [ludonaute], eight epics [japon brand], minerva [japon brand], heroes [rebel.pl], isle of skye [lookout games], kemble's cascade [zman], letter tycoon [squirmy beast], loop inc [eagle gryphon], meteor [mayday games], stockpile [nauvoo games/mayday], mistfall [nskn], mysterium [libellud], new york 1901 [blue orange], rome: city of marble [r&r games], shakespeare [ystari], small city [LUDIKBAZAR], spirits of the rice paddy [APE games], steampark rally [roxley], super motherlode [roxley], suburbia 5* [bezier], the 7th Continent [serious poulp], the gallerist [eagle gryphon games], wharfside [eagle gryphon games], thrash n roll [game fabrica/polish publishing league], thunderbirds [modiphius], trambahn [lookout games], trickerion [mindclash] •••Promos (01:02:47)►►► rahdo runs through: sticker [ludicreations], town center: beune/turku [ludicreations], hanabi: bonus plattchen [abacusspiele], cacao: volcano tiles [abacusspiele], citrus: neue landscahftsplattchen (3 special power tiles) [dlp], keyflower: pig shelter [r&d], voyages of marco polo: 4 new characters +more [hans im gluck], 7 wonders duel: an extra wonder & ex-ludis [repos], carson city promo pack [quined], 504: poster/map) [stronghold [2f-spiele], Snowdonia: six new cards [suprised stare], front nine: new card [ragnar brothers stand], la granja: 6 new cards [stronghold/pd-verlag], heroes:4 monster cards [rebel.pl], shakespeare: prospero card [ystari], new york 1901: flatiron [blue orange games] •••Demoable Only (01:10:23)►►► alone [horrible games], cover me [jumping turtle games], exo [ion game design], apollo xiii [pendragon game studio], iki [utsuroi], mystery! motive for murder [mayfair], mysterium expansion [igames], fog of love [hush hush], morocco [eagle gryphon games], hope [morning players], guilds of london [surprised stare], ein fest fur oden [feureland spiele], the networks [formal ferret games], perdition's mouth [dragon dawn/arctic union], steam ship company [pd verlag], epoch: early inventors [emma] •••To Buy or Not to Buy (01:34:20) from http://is.gd/rahdoessen2015 ►►► chronicler [deinko games], poulettes [blue orange], celestia [blam/blackrock games], alien artifacts [trefl joker line], skyliners [hans im gluck/zman], operation kindergarten [ludicreations], they come unseen [osprey games], codenames [cge], lignum [mucke spiele], a game of gnomes [fragor games], la glace et le ciel [jeux opla], pollen [jeux opla], rattle battle grab the loot [portal games], theseus: dark orbit - hunters [portal], plus ultra: court of the emperor charles V [meridiano 6], ars universalis [meridiano 6 (no booth)], big book of madness [iello], champions of midgard [grey fox games], andromeda [galakta], cvlizations [granna], bretagne [post scriptum/placentia/demoela], bastion [hobby world], apocalypse chaos [zman], kune v lakia [ludicreations], dilluvia project [spielworxx], haithabu [spielworxx], food chain magnate [splotter spellen], castellion [zman], amphipolis [desyllas games], siggil [capsicum games], antarctica [argentum verlag], neanderthal [sierra madre games], steam time [kosmos], piratoons [blackrock games], ships [treefrog], carcassonne: star wars [hans im gluck], potion explosion [horrible games], time stories [space cowboys], vampire radar [japon brand], royal goods [osterreichisches spiele museum], expo 1906 [gotha games], stronghold 2nd edition [portal/stronghold], watson & holmes [ludonova], karuba [haba], haspelknecht [quined games], automobiles [AEG], russian railroads: german railroads [hans im gluck], galaxy trucker: missions [cge], tash-kalar: nethervoid [cge], council of four [cranio creations], samara [cwali], concordia: salsa [pd verlag], tides of time [portal [pegasus], steam works [tmg/adc blackfire], the bloody inn [pearl games], rokoko expansion [eggertspiele/pegasus], inhabit the earth [r&d games], odyssey: wrath of poseidon [ares games], carson city: horses & heroes [quined games], octodice [pegasus spiele], gold west [tasty minstrel games], aya [Act In Games], the prodigals club [cge], mombasa [eggerspiele/r&r], 504 [stronghold & 2f spiele], brettspiele adventskalender 2015 [frosted games], adventure land [haba], my village [eggertspiele], peloponnes card game [irongames], orleans: invasions [dlp], grand austria hotel [lookout games], hengist [lookout games], simurgh [nskn], 7 wonders: duel [repos], Signorie [what's your game], nippon [what's your game], porta nigra [gigamic [stronghold [eggertspiele], pursuit of happiness [artipia games], nations: dynasties [lautapelit], artifacts inc [red raven], Legend of Andor [Chada & Thorn [kosmos], roll for the galaxy ambition [rio grande/brave new world], pandemic legacy [zman] •••Direct MP3 link: https://archive.org/download/RTT005/RTT005.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #4",
      "description": "CATCHUP! SHOW NOTES: •••What Have We Been Playing? (00:00:40)►►► prime time, the networks •••Games of Interest (00:10:13)►►► nations dynasties, galaxy trucker missions, russian railroads german railroads, theseus hunters, automobiles, lunarchitects, burano, peloponnes card game, runebound 3rd edition, fury of dracula 3rd edition, warhammer quest the card game,pursuit of happiness, inhabit the earth, treasure hunter, dingo's dreams, brettspiel adventskalendar, aya, grand austria hotel, hengist, morocco, adventure land •••Q&A (00:41:40)►►► underrated game designers, rare game finds, the peter molyneux of boardgames, my top10, ethical content in boardgames, prototypes, the movies, real life runthroughs, more prototypes, dice tower overlap, playtesting •••Top 10 Recaps (01:18:30)►►► must have games, interaction without violence •••Direct MP3 link: https://ia601500.us.archive.org/33/items/RRT004/RRT004.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #3",
      "description": "GENCON! GENCON! GENCON!!! SHOW NOTES: •••What to buy at Gencon 2015? (00:03:26)►►► apocalypse chaos, ryu, catan traveler edition, meteor, champions of midgard, star trek 5 year mission, medieval academy, flick em up, one deck dungeon, space cadets away missions, extra extra, lanterns: the harvest festival, princess bride games, wrath of dragons, tragedy looper midnight circle, steam works, dungeon of fortune, nefarious, welcome to the dungeon, king's armory, fidelitas, among the stars revival, new york 1901, suburbia 5*, eminent domain microcosm, the grizzled, codenames, gold west, heroes wanted stuff of legend, rattle battle grab the loot, cthulhu realms, shadowrift archfiends, stockpile, trambahn, valley of kings afterlife, isle of skye, spirits of the rice paddy, kraftwagen, mottainai, artifacts inc, mysterium, tides of time, viceroy, queen's architect, la granja •••What to demo at Gencon 2015? (01:49:06)►►► poseidon's kingdom, fury of dracula, castles of mad king ludwig secrets, castle panic dark titan, tumult royal, steam time, looting atlantis, darkrock ventures, favour of the pharoah, trickerion, the networks, shadow over westminster, extraordinary voyages, consequential, 1001 odysseys, storm hollow, snow tails, attack on titan, ninja camp, spirit island, fuse, odyssey wrath of posdeidon, mistfall, lunarchitects, thunderbirds, legends of andor, dice city, above & below, roll for the galaxy ambition, gloomhaven •••Direct MP3 link: https://archive.org/download/RRT003_20150727/RRT-003.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #2",
      "description": "Too many new games! Questions (plus) Answers! Engine building games broken down! SHOW NOTES: •••What Have We've Been Playing? (00:01:40)►►► Elysium, Voyages of Marco Polo, Specter Ops, Cthulhu Realms, Flip City, Dungeon of Fortune, Bottlecap Vikings •••Games of Interest (01:09:55)►►► Legends of Andor: Chada & Thorn, The Loser's Club, Unnamed Castles of Burgundy Sequel, Council of Four, Rattle Battle Grab the Loot, Dice City, Shadowrift 2nd Edition, Legacy Time Surge, Shadowrun Crossfire High Caliber Ops, Villages of Valeria, Minerva, Shakespeare, Apollo XIII, Octo Dice •••Q&A (01:40:02)►►► How often do we play games? Do we ever play \"mean\" games? Do we miss playing with more than 2? Am I going to design my own game? Would I take a prototype to a publisher or Kickstarter? How does the boardgame industry compare to the videogame industry?  How did you relocate from the US to Malta?  More questions? Send your fragen to questions@rahdo.com! •••Top 10 Revisited (02:16:35)►►► Engine building games! Original top10 video: https://www.youtube.com/watch?v=KAKtwJa9J4s •••Direct MP3 link: https://ia601502.us.archive.org/6/items/RTT002/RTT-002.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    },
    {
      "title": "RTT Episode #1",
      "description": "Dominion, a thematic game! How to start a boardgame cafe! Filler Games galore! SHOW NOTES: •••What Have We've Been Playing? (00:01:54)►►► Dead Men Tell No Tales, New York 1901, Stockpile, Kraftwagen, Parfum, Queen's Architect •••Games of Interest (00:23:05)►►► 7th Continent, Oracle of Delphi, Solar 3X, Manhattan Project Chain Reaction, Carson City Horses & Heroes, Signorie, Samara, Centerville •••Q&A (00:36:10)►►► Send your fragen to questions@rahdo.com! •••Victory Point Cafe Interview (00:36:54)►►► Check out the kickstarter at https://www.kickstarter.com/projects/vpcafe/victory-point-cafe-berkeleys-first-board-game-cafe •••Thematic Review (00:57:37)►►► Dominion... that's right! Dominion! •••Top 10 Revisited (01:07:11)►►► Filler games! Original top10 video: https://www.youtube.com/watch?v=6mo9cg3IwbI •••Direct MP3 link: https://ia601501.us.archive.org/24/items/RTT001/RTT-001.mp3 •••Subscribe: http://feeds.feedburner.com/RahdoTalksThrough"
    }
  ]
}